Функция Печать(ИмяМакета = "", ПараметрыПечати = Неопределено, СтруктураВнешнихПараметров = Неопределено) Экспорт//ZAM 10.05.2013 Ошибка при пакетной печати.Сделать сертификаты, чтобы реагировали на настройки
	
	ТабДокумент=Новый ТабличныйДокумент;
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	Application=Новый COMОбъект("Word.Application");
	//ZAM+++ 10.05.2013 Ошибка при пакетной печати.Сделать сертификаты, чтобы реагировали на настройки
	Если СтруктураВнешнихПараметров<>Неопределено Тогда
		ПечататьНаПринтер     = СтруктураВнешнихПараметров.ПечататьНаПринтер;
		Принтер               = СтруктураВнешнихПараметров.Принтер;
		КоличествоЭкземпляров = СтруктураВнешнихПараметров.КоличествоЭкземпляров;
	Иначе
		ПечататьНаПринтер     = Истина;
		Принтер               = Application.ActivePrinter;
		КоличествоЭкземпляров = 1;
	КонецЕсли;
	//Application.ScreenUpdating = Не ПечататьНаПринтер;
	//Application.Visible = Не ПечататьНаПринтер;
	Application.ScreenUpdating = Ложь;
	Application.Visible = Ложь;
	Application.ActivePrinter = Принтер;
	Application.DisplayAlerts = False;
	
	//ZAM--- 10.05.2013
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	НоменклатураСертификаты.ПутьДоФайла КАК ПутьДао
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Сертификаты КАК НоменклатураСертификаты
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураСертификаты.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	//KAV++ Крапивин Андрей 17-07-2016 17:00 #1209178 Теперь можно печать и упр документы
	//|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете
	//KAV-- 17-07-2016 17:00
	|	И НоменклатураСертификаты.Действителен";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяФайла = ВыборкаДетальныеЗаписи.ПутьДао;
		Сообщить("Печатаем документ: " + ИмяФайла);
		Если ПечататьНаПринтер Тогда//ZAM 10.05.2013 Ошибка при пакетной печати.Сделать сертификаты, чтобы реагировали на настройки
			Если Прав(ИмяФайла,3)="pdf" Тогда
				//Сообщить("Почти напечатали в пэдээфе "+ИмяФайла);
				ЗапуститьПриложение("C:\1CWORK\sumatrapdf.exe -print-to-default -exit-on-print "+""""+ИмяФайла+"""");
			Иначе//значит это word
				Шаблон = Application.Documents.Open(ИмяФайла,, -1);
				Шаблон.PrintOut();
				//Сообщить("Почти напечатали в ворде "+ИмяФайла);
				Шаблон.Close(Истина);
			КонецЕсли;
		КонецЕсли;
		//Прервать;
	КонецЦикла;
КонецФункции // Печать()
