
// Функция формирует табличный документ с реестром сертификатов
//
// Возвращаемое значение:
//  Табличный документ - сформированная печатная форма
//
Функция ПечатьСправки(СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата", НачалоДня(СсылкаНаОбъект.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.НомерВходящегоДокумента КАК НомерДок,
	|	Док.Дата КАК ДатаДок,
	|	Док.Организация.НаименованиеПолное КАК Организация,
	|	Док.Контрагент.НаименованиеПолное КАК Контрагент,
	|	Док.Контрагент.ИНН,
	|	Док.Контрагент.КПП,
	|	Док.Организация.ИНН,
	|	Док.Организация.КПП,
	|	Док.Организация КАК ОрганизацияСсылка,
	|	Док.Контрагент КАК КонтрагентСсылка,
	|	Док.Ответственный
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Ссылка = &ТекущийДокумент";
	
	ТекстТовары = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ДокТовары.КоличествоМест, ДокТовары.Количество)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ДокТовары.Количество * СведенияОбАлкогольнойПродукции.КоэффПересчетаДал, 0)) КАК Объем,
	|	ДокТовары.Номенклатура КАК Номенклатура,
	|	ДокТовары.ЕдиницаИзмерения КАК ЕдМест
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ДокТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
	|		ПО ДокТовары.Номенклатура = СведенияОбАлкогольнойПродукции.Номенклатура
	|ГДЕ
	|	ДокТовары.Ссылка = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокТовары.Номенклатура,
	|	ДокТовары.ЕдиницаИзмерения";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_СправкаТТН";
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ПолеСверху				= 0;
	ТабДокумент.ПолеСлева				= 0;
	ТабДокумент.ПолеСнизу				= 0;
	ТабДокумент.ПолеСправа				= 0;
	ТабДокумент.РазмерКолонтитулаСверху	= 0;
	ТабДокумент.РазмерКолонтитулаСнизу	= 0;
	
	Макет = ПолучитьМакет("СправкаБ");
	ОбластьМакета = Макет.ПолучитьОбласть("СправкаБ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата", НачалоДня(СсылкаНаОбъект.Дата));
	Запрос.Текст = ТекстТовары;		
	ЗапросТовары = Запрос.Выполнить();
	Выборка = ЗапросТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	//Ответственный=ОбщегоНазначения.ФамилияИнициалыФизЛица(СсылкаНаОбъект.Ответственный.ФизЛицо);

	Сч=0;
	АдресОрганизации= ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ОрганизацияСсылка,Шапка.ДатаДок), "ЮридическийАдрес")+Символы.ПС+ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ОрганизацияСсылка,Шапка.ДатаДок), "ФактическийАдрес");
	АдресКонтрагента=ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.КонтрагентСсылка,Шапка.ДатаДок), "ЮридическийАдрес")+"; ";
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Грузополучатель) Тогда
		АдресКонтрагента=АдресКонтрагента+Символы.ПС+ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(СсылкаНаОбъект.Грузополучатель,Шапка.ДатаДок), "ФактическийАдрес");
	Иначе
		АдресКонтрагента=АдресКонтрагента+Символы.ПС+ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.КонтрагентСсылка,Шапка.ДатаДок), "ФактическийАдрес");
	КонецЕсли;
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
		ОбластьМакета.Параметры.НомерДок=СформироватьНомерНаПечать(Шапка.НомерДок);
		
		ОбластьМакета.Параметры.АдресОрганизации = АдресОрганизации;
		ОбластьМакета.Параметры.АдресКонтрагента = АдресКонтрагента;
		
		Объем = 0;
		Количество = 0;
		НоменклатураНаименованиеПолное = "";
		
		ОбластьМакета.Параметры.НоменклатураНаименованиеПолное = Выборка.Номенклатура.НаименованиеПолное;
		ОбластьМакета.Параметры.ДатаДок = Формат(Шапка.ДатаДок, "ДЛФ=ДД");
		ОбластьМакета.Параметры.Количество = "" + Выборка.Объем + " дал. \ " + Выборка.Количество+" "+Выборка.ЕдМест.Наименование;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
		|	ЕстьNull(КонтактнаяИнформация.Представление,"""") Как Доверенность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&Дата,
		|			СтруктурнаяЕдиница = &Организация
		|				И ОтветственноеЛицо = &Уполномоченный) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Вид = &ДругаяИнформация)";
		
		Запрос.УстановитьПараметр("Дата", Шапка.ДатаДок);
		Запрос.УстановитьПараметр("ДругаяИнформация", Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияФизЛица);
		Запрос.УстановитьПараметр("Организация", СсылкаНаОбъект.Организация);
		Запрос.УстановитьПараметр("Уполномоченный", Перечисления.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ОбластьМакета.Параметры.ФИОПокупателя=ОбщегоНазначения.ФамилияИнициалыФизЛица(ВыборкаДетальныеЗаписи.ФизическоеЛицо)+", "+ВыборкаДетальныеЗаписи.Должность.Наименование;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		Сч=Сч+1;
		Если Сч=2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Сч=0;
		КонецЕсли;
	КонецЦикла;
	
	//подпись
	Возврат ТабДокумент;
	
КонецФункции

// Внешняя функция печати
// Параметры
//  ИмяМакета  – Строка – имя формы печати
//
// Возвращаемое значение:
//   Булево   –Печать прошла успешно - Истина, иначе - Ложь
//
//Функция Печать(ИмяМакета = "", КоличествоЭкземпляров = 1, НаПринтер = Ложь)	Экспорт
Функция Печать(ИмяМакета = "", ПараметрыПечати = Неопределено)	Экспорт
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяМакета = "Справка";
	ТабДокумент = ПечатьСправки(СсылкаНаОбъект);
	
	//Определим параметры печати
	Если ПараметрыПечати <> Неопределено Тогда
		КоличествоЭкземпляров = 1;
		Если НЕ(ПараметрыПечати.Свойство("КоличествоЭкземпляров",КоличествоЭкземпляров)) Тогда
			КоличествоЭкземпляров = 1;			
		КонецЕсли;
		НаПринтер = Ложь;
		Если НЕ(ПараметрыПечати.Свойство("НаПринтер",НаПринтер)) Тогда
			НаПринтер = Ложь;			
		КонецЕсли;
	КонецЕсли;
	Если КоличествоЭкземпляров = Неопределено Тогда
		КоличествоЭкземпляров = 1;
	КонецЕсли;
	Если НаПринтер = Неопределено Тогда
		НаПринтер = Ложь;
	КонецЕсли;

	Возврат ТабДокумент;

КонецФункции // Печать()

Функция СформироватьНомерНаПечать(Номер) 
	НомерТемп=Номер;
	
	Пока НЕ (Лев(НомерТемп, 1)>"0" И Лев(НомерТемп, 1)<="9") Цикл
		НомерТемп = Сред(НомерТемп, 2);
	КонецЦикла;	
	Возврат НомерТемп;

КонецФункции

