Функция Печать() Экспорт
	
	//Сообщить("документ: "+СсылкаНаОбъект);	
	ПоляОтступа = 0;
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху         = ПоляОтступа;
	ТабДокумент.ПолеСлева          = 15;
	ТабДокумент.ПолеСнизу          = ПоляОтступа;
	ТабДокумент.ПолеСправа         = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.МасштабПечати = 100;
	//ТабДокумент.АвтоМасштаб = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("МХ3Альбом");
	
	ОблМакетаШапкаПервойСтраницы    = Макет.ПолучитьОбласть("ШапкаПервойСтраницы");
	ОблМакетаШапкаТаблицы 			= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОблМакетаСтрока           		= Макет.ПолучитьОбласть("Строка");
	ОблМакетаИтого  				= Макет.ПолучитьОбласть("Итого");
	//ВтораяСтраница
	ОблМакетаШапкаРаботыУслуги      = Макет.ПолучитьОбласть("ШапкаРаботыУслуги");
	ОблМакетаСтрокаРаботыУслуги     = Макет.ПолучитьОбласть("СтрокаРаботыУслуги");
	ОблМакетаПодвалРаботыУслуги 	= Макет.ПолучитьОбласть("ПодвалРаботыУслуги");
	ОблМакетаПодвал 			  	= Макет.ПолучитьОбласть("Подвал");
	
	
	// Выводим ШапкаПервойСтраницы
	
	ЗапросОрганизация = Новый Запрос;
	ЗапросОрганизация.Текст = "ВЫБРАТЬ
	                          |	КонтактнаяИнформация.Представление КАК АдресОрганизации
	                          |ИЗ
	                          |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                          |		ПО ПеремещениеТоваров.Контрагент = КонтактнаяИнформация.Объект
	                          |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	                          |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
	                          |ГДЕ
	                          |	ПеремещениеТоваров.Ссылка = &ТекущийДокумент";
	
	ЗапросОрганизация.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	ВыборкаОрганизация = ЗапросОрганизация.Выполнить().Выбрать();
	ВыборкаОрганизация.Следующий();
	
	ОблМакетаШапкаПервойСтраницы.Параметры.ОрганизацияХранитель = СсылкаНаОбъект.Организация.НаименованиеПолное+", "+ВыборкаОрганизация.АдресОрганизации;
	
	
	
	
	ОблМакетаШапкаПервойСтраницы.Параметры.СтркткрноеПодразделение = СсылкаНаОбъект.Склад;
	
	
	ЗапросКонтрагент = Новый Запрос;
	ЗапросКонтрагент.Текст = "ВЫБРАТЬ
	                         |	КонтактнаяИнформация.Представление КАК АдресКонтрагента
	                         |ИЗ
	                         |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                         |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                         |		ПО ПеремещениеТоваров.Организация = КонтактнаяИнформация.Объект
	                         |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	                         |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	                         |ГДЕ
	                         |	ПеремещениеТоваров.Ссылка = &ТекущийДокумент";
	
	ЗапросКонтрагент.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	
	ВыборкаКонтрагент = ЗапросКонтрагент.Выполнить().Выбрать();
	ВыборкаКонтрагент.Следующий();
	
	ОблМакетаШапкаПервойСтраницы.Параметры.Поклажедатель = СсылкаНаОбъект.Контрагент.НаименованиеПолное+", "+ВыборкаКонтрагент.АдресКонтрагента;
	
	ОблМакетаШапкаПервойСтраницы.Параметры.НомерДоговора 		= СсылкаНаОбъект.ДоговорКонтрагента.Номер;
	ОблМакетаШапкаПервойСтраницы.Параметры.ДатаДоговора 		= СсылкаНаОбъект.ДоговорКонтрагента.Дата;
	ОблМакетаШапкаПервойСтраницы.Параметры.НомерДокумента 		= СсылкаНаОбъект.Номер;
	ОблМакетаШапкаПервойСтраницы.Параметры.ДатаДокумента 		= СсылкаНаОбъект.Дата;
	
	// Выводим ШапкаПервойСтраницы
	ТабДокумент.Вывести(ОблМакетаШапкаПервойСтраницы);
	
	// Выводим ШапкаТаблицы
	ТабДокумент.Вывести(ОблМакетаШапкаТаблицы);
	
	// Выводим Строка
	МассивОбластей = новый Массив;
	СтраницаНомер = 1;
	фСуммаПоСтранице = 0;
	Для каждого стрДок Из СсылкаНаОбъект.Товары Цикл
		ОблМакетаСтрока.Параметры.Заполнить(стрДок);   //заполним строку как есть и меняем данные как надо
		НоменклатураСсылка = Справочники.Номенклатура.НайтиПоКоду(стрДок.Номенклатура.Код);
		//Заполняем Наименование =  НаименованиеПолное + СерияНоменклатуры
		ОблМакетаСтрока.Параметры.Номенклатура = НоменклатураСсылка.НаименованиеПолное+", "+ стрДок.СерияНоменклатуры;
		//УберЁм ХарактеристикаНоменклатуры
		ОблМакетаСтрока.Параметры.ХарактеристикаНоменклатуры =  "";
		//Обрабатываем Артикул
		строкаОбработки = НоменклатураСсылка.Артикул;
		Если НоменклатураСсылка.ВидНоменклатуры.Код = "ПРП000001" ИЛИ НоменклатураСсылка.ВидНоменклатуры.Код = "000000001" Тогда
			ОблМакетаСтрока.Параметры.Артикул = строкаОбработки;
		Иначе
			Позиция = Найти(строкаОбработки, "-");
			ПервоеСлово = Сред(строкаОбработки, 1, Позиция-1);
			ВтороеСлово = Сред(строкаОбработки, Позиция+1);
			ОблМакетаСтрока.Параметры.Артикул = ВтороеСлово+"-"+ПервоеСлово;
		КонецЕсли;
		//ТабДокумент.Вывести(ОблМакетаСтрока);
		
		фСуммаПоСтранице = 	фСуммаПоСтранице  +  стрДок.Сумма;
		
		МассивОбластей.Очистить();					
		МассивОбластей.Добавить(ОблМакетаСтрока);
		
		МассивОбластей.Добавить(ОблМакетаИтого);  //Добавляем контрольную строку
		МассивОбластей.Добавить(ОблМакетаИтого);  //Добавляем контрольную строку
		
		Если ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ТабДокумент.Вывести(ОблМакетаСтрока);
		Иначе	
			ТабДокумент.Вывести(ОблМакетаСтрока);
			ОблМакетаИтого.Параметры.Стоимость = Формат(фСуммаПоСтранице, "ЧДЦ=2");
			
			ОблМакетаИтого.Параметры.НомерСтраницы = "Страница: " + СтраницаНомер;
			
			ТабДокумент.Вывести(ОблМакетаИтого);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОблМакетаШапкаТаблицы);
			фСуммаПоСтранице = 0;
			СтраницаНомер = СтраницаНомер + 1
		КонецЕсли;	
		
	КонецЦикла;
	
	// Выводим Итого
	ОблМакетаИтого.Параметры.Стоимость = Формат(фСуммаПоСтранице, "ЧДЦ=2");
	ОблМакетаИтого.Параметры.НомерСтраницы = "Страница: " + СтраницаНомер;
	ТабДокумент.Вывести(ОблМакетаИтого);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();			
	
	ОблМакетаШапкаРаботыУслуги.Параметры.Стоимость = Формат(СсылкаНаОбъект.СуммаДокумента, "ЧДЦ=2");
	ТабДокумент.Вывести(ОблМакетаШапкаРаботыУслуги);
	
	ТабДокумент.Вывести(ОблМакетаСтрокаРаботыУслуги);
	ТабДокумент.Вывести(ОблМакетаПодвалРаботыУслуги);
	
	ТабДокумент.Вывести(ОблМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции	

