
Процедура ОсновныеДействияФормыПечатьСВыводомНаЭкран(Кнопка)
	
	Печать("Справка").Показать();
	Если Не СсылкаНаОбъект.ДокументРаспечатан Тогда
		Если СсылкаНаОбъект.Дата < ТекущаяДата() - 7*24*60*60 Тогда
		Иначе
			ОбъектПоСсылке = СсылкаНаОбъект.ПолучитьОбъект();
			ОбъектПоСсылке.ДокументРаспечатан = Истина;
			ОбъектПоСсылке.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыПечатьНапринтер(Кнопка)
	
	ПараметрыПечати = Новый Структура("КоличествоЭкземпляров, НаПринтер");
	ПараметрыПечати.КоличествоЭкземпляров = 1;
	ПараметрыПечати.НаПринтер = Истина;

	Печать("Справка", ПараметрыПечати);
	Если Не СсылкаНаОбъект.ДокументРаспечатан Тогда
		Если СсылкаНаОбъект.Дата < ТекущаяДата() - 7*24*60*60 Тогда
		Иначе
			ОбъектПоСсылке = СсылкаНаОбъект.ПолучитьОбъект();
			ОбъектПоСсылке.ДокументРаспечатан = Истина;
			ОбъектПоСсылке.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

