перем Морфер;
Перем МассивПадежей;
#Область Получение_данных_для_печати
Функция ПолучитьДанныеПоОрганизации(ЗНАЧ Организация,ДатаДанных=Неопределено) Экспорт
	Организация=Справочники.Организации.ПустаяСсылка();
	СтруктураВозврата=Новый Структура;
	СтруктураВозврата.Вставить("ОрганизацияПолное",	Организация.НаименованиеПолное);
	СтруктураВозврата.Вставить("ОрганизацияСокр",	Организация.НаименованиеСокращенное);
	СтруктураВозврата.Вставить("ИНН",				Организация.ИНН);
	СтруктураВозврата.Вставить("КПП",				Организация.КПП);
	СтруктураВозврата.Вставить("ОРГН",				Организация.ОГРН);
КонецФункции

Функция ПолучитьДанныеПоСотруднику(ЗНАЧ Сотрудник,ДатаДанных=Неопределено) Экспорт
КонецФункции

Функция ПолучитьДанныеПоФизЛицу(ЗНАЧ ФизЛицо,ДатаДанных=Неопределено) Экспорт
	СтруктураВозврата=Новый Структура;
	
	СтруктураВозврата.Вставить("ДатаРождения",	Формат(ФизЛицо.ДатаРождения,"ДЛФ=DD"));
	СтруктураВозврата.Вставить("ГодРождения",	Формат(Год(ФизЛицо.ДатаРождения),"ЧЦ=4; ЧГ="));
	
#Область ФИО
	ДанныеФИО=ПолучитьСклоненияИзРегистраСвойств(ФизЛицо);
	Если ДанныеФИО=Неопределено Тогда
		Рез=РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(?(ДатаДанных=Неопределено,ТекущаяДатаСеанса(),КонецДня(ДатаДанных)),Новый Структура("ФизЛицо",ФизЛицо));
		ДанныеФИО=ПросклонятьМорфер(Рез.Фамилия+" "+Рез.Имя+" "+Рез.Отчество);
		//Сохраняем в регистр
		ВыборкаСвойств=ПланыВидовХарактеристик.СвойстваОбъектов.Выбрать(,Новый Структура("НазначениеСвойства",ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица));
		Пока ВыборкаСвойств.Следующий() Цикл
			Если МассивПадежей.Найти(ВыборкаСвойств.Наименование)<>Неопределено Тогда
				ЗаписьСклонения=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				ЗаписьСклонения.Объект		= ФизЛицо;
				ЗаписьСклонения.Свойство	= ВыборкаСвойств.Ссылка;
				ЗаписьСклонения.Значение	= ДанныеФИО[МассивПадежей.Найти(ВыборкаСвойств.Наименование)];
				ЗаписьСклонения.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
#КонецОбласти
	
#Область Паспорт
	Срез=РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(?(ДатаДанных=Неопределено,ТекущаяДатаСеанса(),КонецДня(ДатаДанных)),Новый Структура("ФизЛицо",ФизЛицо));
	Если ЗначениеЗаполнено(Срез.ДокументСерия) Тогда
		СтруктураВозврата.Вставить("Серия",Срез.ДокументСерия);
	Иначе
		СтруктураВозврата.Вставить("Серия","______");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Срез.ДокументНомер) Тогда
		СтруктураВозврата.Вставить("Номер",Срез.ДокументНомер);
	Иначе
		СтруктураВозврата.Вставить("Номер","___________");
	КонецЕсли;
	Если ЗначениеЗаполнено(Срез.ДокументКемВыдан) Тогда
		СтруктураВозврата.Вставить("Выдан",Срез.ДокументКемВыдан);
	Иначе
		СтруктураВозврата.Вставить("Выдан","________________________________________________________________");
	КонецЕсли;	
	Если ЗначениеЗаполнено(Срез.ДокументДатаВыдачи) Тогда
		СтруктураВозврата.Вставить("ДатаВыдачи",Формат(Срез.ДокументДатаВыдачи,"ДФ='dd MMMM yyyy ""г.""'"));
	Иначе
		СтруктураВозврата.Вставить("Номер"," ""___"" ________  _____ г.");
	КонецЕсли;
#КонецОбласти

#Область Адреса
	Данные = Новый Структура("Объект, Тип, Вид",ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
	Если Результат <> Неопределено Тогда
		СтруктураВозврата.Вставить("АдресРегистрации",Результат.Представление);
	Иначе
		СтруктураВозврата.Вставить("АдресРегистрации","_____________________________________________________________________");
	КонецЕсли;
	
	Данные = Новый Структура("Объект, Тип, Вид",ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
	Если Результат <> Неопределено Тогда
		СтруктураВозврата.Вставить("АдресПроживания",Результат.Представление);
	Иначе
		СтруктураВозврата.Вставить("АдресПроживания","_____________________________________________________________________");
	КонецЕсли;
#КонецОбласти

	Возврат СтруктураВозврата;
КонецФункции

Функция ПолучитьДанныеПоДолжности(ЗНАЧ Должность) Экспорт
КонецФункции
#КонецОбласти

#Область Вспомогательные_процедуры_и_функции
Функция ПросклонятьМорфер(ВхСтрока)
	Попытка
		результат = Морфер.GetXml(ВхСтрока);
		РезВозврат=Новый Массив;
		РезВозврат.Добавить(ВхСтрока);
		РезВозврат.Добавить(результат.Р);
		РезВозврат.Добавить(результат.Д);
		РезВозврат.Добавить(результат.В);
		РезВозврат.Добавить(результат.Т);
		РезВозврат.Добавить(результат.П_о);
		Возврат РезВозврат;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПолучитьСклоненияИзРегистраСвойств(Объект)
	РезВозврат=Новый Массив;
	Если ТипЗнч(Объект)=Тип("СправочникСсылка.ФизическиеЛица") Тогда
		НазначениеСвойства=ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
	ИначеЕсли ТипЗнч(Объект)=Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		НазначениеСвойства=ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДолжностиОрганизаций;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство.НазначениеСвойства = &НазначениеСвойства";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если МассивПадежей.Найти(ВыборкаДетальныеЗаписи.Свойство)<>Неопределено Тогда
			РезВозврат.Вставить(МассивПадежей.Найти(ВыборкаДетальныеЗаписи.Свойство),ВыборкаДетальныеЗаписи.Значение);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(РезВозврат) Тогда
		Возврат РезВозврат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
#КонецОбласти

ОпределениеМорфер=Новый WSОпределения("http://api.morpher.ru/WebService.asmx?WSDL");
Морфер=Новый WSПрокси(ОпределениеМорфер,"http://morpher.ru/","WebService","WebServiceSoap");

МассивПадежей=Новый Массив;
МассивПадежей.Добавить("1. Именительный");
МассивПадежей.Добавить("2. Родительный");
МассивПадежей.Добавить("3. Дательный");
МассивПадежей.Добавить("4. Винительный");
МассивПадежей.Добавить("5. Творительный");
МассивПадежей.Добавить("6. Предложный");
