// Внешняя функция печати
// КТ-2000: (095)789-3070
// Параметры
//  ИмяМакета  – Строка – имя формы печати
//
// Возвращаемое значение:
//   Булево   –Печать прошла успешно - Истина, иначе - Ложь
//
Функция Печать(ИмяМакета = "", ПараметрыПечати = Неопределено)	Экспорт

	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(СсылкаНаОбъект.Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат Ложь;
	КонецЕсли;
	
	ТабДокумент = ПечатьДокумента(СсылкаНаОбъект);
	
	//Определим параметры печати
	Если ПараметрыПечати <> Неопределено Тогда
		КоличествоЭкземпляров = 1;
		Если НЕ(ПараметрыПечати.Свойство("КоличествоЭкземпляров",КоличествоЭкземпляров)) Тогда
			КоличествоЭкземпляров = 1;			
		КонецЕсли;
		НаПринтер = Ложь;
		Если НЕ(ПараметрыПечати.Свойство("НаПринтер",НаПринтер)) Тогда
			НаПринтер = Ложь;			
		КонецЕсли;
	КонецЕсли;
	Если КоличествоЭкземпляров = Неопределено Тогда
		КоличествоЭкземпляров = 1;
	КонецЕсли;
	Если НаПринтер = Неопределено Тогда
		НаПринтер = Ложь;
	КонецЕсли;
	Возврат ТабДокумент;

КонецФункции // Печать()

Функция ПечатьДокумента(СсылкаНаДокумент)
	МакетWord=ПолучитьМакет("Макет");
	
	MSWord=МакетWord.Получить();
	Попытка
		Документ=MSWord.Application.Documents(1);
		Замена=Документ.Content.Find;
		Замена.Execute("[DocNum]",		Ложь,Истина,Ложь,,,Истина,,Ложь,СсылкаНаДокумент.Номер);
		Замена=Документ.Content.Find;
		Замена.Execute("[DocDate]",		Ложь,Истина,Ложь,,,Истина,,Ложь,Формат(СсылкаНаДокумент.Дата,"ДФ='dd MMMM yyyy ""г.""'"));
		Замена=Документ.Content.Find;
		Замена.Execute("[UserFull]",	Ложь,Истина,Ложь,,,Истина,,Ложь,СсылкаНаДокумент.УполномоченныйПриказа.Наименование);
		Замена=Документ.Content.Find;
		Замена.Execute("[Type]",		Ложь,Истина,Ложь,,,Истина,,Ложь,Строка(СсылкаНаДокумент.ВидОперации));
		Замена=Документ.Content.Find;
		Замена.Execute("[Period]",		Ложь,Истина,Ложь,,,Истина,,Ложь,Строка(СсылкаНаДокумент.Периодичность));
		Замена=Документ.Content.Find;
		Замена.Execute("[DateStart]",	Ложь,Истина,Ложь,,,Истина,,Ложь,Формат(СсылкаНаДокумент.СрокПриказаС,"ДФ='dd MMMM yyyy ""г.""'"));
		Замена=Документ.Content.Find;
		Замена.Execute("[DateFinish]",	Ложь,Истина,Ложь,,,Истина,,Ложь,Формат(СсылкаНаДокумент.СрокПриказаПо,"ДФ='dd MMMM yyyy ""г.""'"));
		Замена=Документ.Content.Find;
		Замена.Execute("[Text]",		Ложь,Истина,Ложь,,,Истина,,Ложь,СсылкаНаДокумент.ТекстПриказа);
		Замена=Документ.Content.Find;
		Замена.Execute("[UserSmall]",	Ложь,Истина,Ложь,,,Истина,,Ложь,ОбщегоНазначения.ФамилияИнициалыФизЛица(СсылкаНаДокумент.УполномоченныйПриказа));
		Замена=Документ.Content.Find;
		Замена.Execute("[CEO]",			Ложь,Истина,Ложь,,,Истина,,Ложь,ОбщегоНазначения.ФамилияИнициалыФизЛица(СсылкаНаДокумент.ИздательПриказа));
		
		ЗаполнитьТаблицуДокумента(MSWord,СсылкаНаДокумент.Лимиты.Выгрузить(),		"[Limits]",			новый Структура("Подразделение,СтатьяДвиженияДенежныхСредств,Сумма"));
		ЗаполнитьТаблицуДокумента(MSWord,СсылкаНаДокумент.Получатели.Выгрузить(),	"[Contragents]",	новый Структура("Получатель"));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	MSWord.Application.Visible=1;
	MSWord.Application.ActiveWindow.Visible=1;
	Документ.Activate();
	Документ.Application.Activate();
	Возврат Неопределено;
	
КонецФункции

// Процедура заполняет таблицу документа Word
//	ОбъектWord - СОМОбъект - документ Word
//	ВыборкаДанных - выборка запроса или ТаблицаЗначений - собственно чем заполняем
//	ПараметрШаблона - строка формата $$****&& - для поиска и позиционирования на таблице документа. Заполняться будет следующая за строкой параметра таблица.
//	СтруктураПолей - структура - Порядок и количество ключей должно соответствовать порядку и количеству колонок в таблице документа. 
//									Ключ - имя поля в выборке "ВыборкаДанных" для заполнения ячейки
//									Значение - строка - заголовок шаки таблицы, не обязателен, работает только с параметром ЗаполнятьШапку = ИСТИНА
//									Для пропуска колонки используем ключи формата _НеЗаполняемХХ (где хх - произвольные символы или число на случай если пропускаемых колонок несколько).
//	НомерПервойСтроки - число - номер первой строки для заполнения, по умолчанию = 2 т.к. считаем, что первая строка это шапка таблицы
//	ЗаполнятьШапку - булево - признак заполнения шапки, если ИСТИНА, то первая строка таблицы заполняется значениями из структуры "СтруктураПолей" 
//									Для пропуска колонки используем ключи формата _НеЗаполняемШапкуХХ, (!!ячеки данных будут так же пропущены!!), если же ключ формата _НеЗаполняемХХ, то ячейка шапки заполняется.
Процедура ЗаполнитьТаблицуДокумента(ОбъектWord, ВыборкаДанных, ПараметрШаблона, СтруктураПолей, НомерПервойСтроки = 2, ЗаполнятьШапку = Ложь) Экспорт
	
	Если ПустаяСтрока(ПараметрШаблона) Тогда
		Возврат;
	КонецЕсли;
	ВыделенныеДанные = ОбъектWord.ActiveWindow.Selection;
	ВыделенныеДанные.GoTo(-1,, , "Nachalo");//переходим в начало документа
	ВыделенныеДанные.Collapse();
	ОбъектПоиск 				= ВыделенныеДанные.Find;
	ОбъектПоиск.Forward 		= True;
	ОбъектПоиск.MatchWildcards 	= False;
	ОбъектПоиск.Text 			= ПараметрШаблона;
	Пока ОбъектПоиск.Execute() Цикл
		ВыделенныеДанные.Delete();
		ВыделенныеДанные.InsertAfter("");			
		ВыделенныеДанные.GoTo(2, 2, 1, "").Select();//выделяем первую таблицу после параметра
		Попытка
			ТаблицаWord = ВыделенныеДанные.Tables(1);//позиционируемся на таблице в выделении
		Исключение
			Сообщить(" - за параметром "+ПараметрШаблона+" не найдено ни одной таблицы!", СтатусСообщения.Внимание);
			Возврат;
		КонецПопытки;
		
		Если ТаблицаWord.Columns.Count+1 < СтруктураПолей.Количество() Тогда
			Сообщить(" - таблица шаблона "+" содержит "+(ТаблицаWord.Columns.Count()+1)+" колонок, из необходимых "+СтруктураПолей.Количество()+"! Таблица пропущена.", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		
		СтрокТаблицы = ТаблицаWord.Rows.Count();
		Если СтрокТаблицы < НомерПервойСтроки Тогда
			ДобавитьСтрок = НомерПервойСтроки - СтрокТаблицы;
			ТаблицаWord.Rows(СтрокТаблицы).Select();
			ВыделенныеДанные.InsertRowsBelow(ДобавитьСтрок);
			СтрокТаблицы = ТаблицаWord.Rows.Count();
		КонецЕсли;
		
		Если ЗаполнятьШапку Тогда
			индексКолонки = 1;
			Для каждого ЗаполняемаяКолонка Из СтруктураПолей Цикл
				индексКолонки = индексКолонки + 1;
				Если Найти(НРег(ЗаполняемаяКолонка.Ключ), "_незаполняемшапку") = 0 Тогда
					ТаблицаWord.Cell(1, индексКолонки).Range.Text = Строка(ЗаполняемаяКолонка.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ТаблицаWord.Rows(СтрокТаблицы).Select();
		
		ЭтоТаблицаЗначений = (ТипЗнч(ВыборкаДанных) = Тип("ТаблицаЗначений"));
		
		НомерСтроки = НомерПервойСтроки;// по умолчанию = 2, т.к. первая строка - шапка
		н = 0;
		КоличествоСтрокДанных = ВыборкаДанных.Количество();
		Для н = 0 По КоличествоСтрокДанных-1 Цикл
			
			Если ЭтоТаблицаЗначений Тогда
				Данные = ВыборкаДанных[н];
			Иначе
				ВыборкаДанных.Следующий();
				Данные = ВыборкаДанных;
			КонецЕсли;
			Если НомерСтроки > СтрокТаблицы Тогда
				ТаблицаWord.Rows(НомерСтроки-1).Select();
				ВыделенныеДанные.InsertRowsBelow();
			КонецЕсли;
			индексКолонки = 1;
			Для каждого ЗаполняемаяКолонка Из СтруктураПолей Цикл
				индексКолонки = индексКолонки + 1;
				Если Найти(НРег(ЗаполняемаяКолонка.Ключ), "_незаполняем") = 0 Тогда
					Если ТипЗнч(Данные[ЗаполняемаяКолонка.Ключ])=Тип("Число") Тогда
						ТаблицаWord.Cell(НомерСтроки, индексКолонки).Range.Text = Формат(Данные[ЗаполняемаяКолонка.Ключ],"ЧДЦ=2; ЧН=-");
					Иначе
						Если НЕ ЗначениеЗаполнено(Данные[ЗаполняемаяКолонка.Ключ]) Тогда
							ТаблицаWord.Cell(НомерСтроки, индексКолонки).Range.Text = "Для всех";
						Иначе
							ТаблицаWord.Cell(НомерСтроки, индексКолонки).Range.Text = Строка(Данные[ЗаполняемаяКолонка.Ключ]);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
