Функция Печать() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Пометка,
		|	МаршрутныйЛистСписокДокументов.Накладная КАК Реализация,
		|	МаршрутныйЛистСписокДокументов.Контрагент
		|ИЗ
		|	Документ.МаршрутныйЛист.СписокДокументов КАК МаршрутныйЛистСписокДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|		ПО МаршрутныйЛистСписокДокументов.Ссылка = МаршрутныйЛист.Ссылка
		|ГДЕ
		|	МаршрутныйЛист.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаршрутныйЛистСписокДокументов.Контрагент.Наименование";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Форма=ПолучитьФорму("ФормаФормированияПакетаДокументов");
	Форма.ТаблицаРеализаций=Запрос.Выполнить().Выгрузить();
	Форма.Открыть();
	Возврат Неопределено;
КонецФункции