
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("Документ.ОтчетОРозничныхПродажах"); //Указываем документ к которому делаем внешнюю печ. форму
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Удаление документа"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", "Удаление Отчёта о розничных продажах и связанных документов"); 
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Удаление документов продажи", "УдалениеДокумента", "ВызовСерверногоМетода", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

Функция СформироватьПечатнуюФорму(СсылкаНаДокумент, ОбъектыПечати)

	// Удалим документ "Кассовая смена"	
	КассоваяСменаОбъект = СсылкаНаДокумент.КассоваяСмена.ПолучитьОбъект();
	Если КассоваяСменаОбъект <> Неопределено Тогда
		Попытка
			КассоваяСменаОбъект.Удалить();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Удалим документы "Отчет о розничных продажах", "Сборка товаров", "Оприходование товаров", "Выемка денежных средств из кассы ККМ"
	ЗапросПодчиненных = Новый Запрос(
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СборкаТоваров.Ссылка
	|ИЗ
	|	Документ.СборкаТоваров КАК СборкаТоваров
	|ГДЕ
	|	СборкаТоваров.ДокументОснование = &ОтчетОРозничныхПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОприходованиеТоваров.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.ДокументОснование = &ОтчетОРозничныхПродажах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыемкаДенежныхСредствИзКассыККМ.Ссылка
	|ИЗ
	|	Документ.ВыемкаДенежныхСредствИзКассыККМ КАК ВыемкаДенежныхСредствИзКассыККМ
	|ГДЕ
	|	ВыемкаДенежныхСредствИзКассыККМ.ОтчетОРозничныхПродажах = &ОтчетОРозничныхПродажах");
	ЗапросПодчиненных.УстановитьПараметр("ОтчетОРозничныхПродажах", СсылкаНаДокумент);
	
	ВыборкаПодчиненных = ЗапросПодчиненных.Выполнить().Выбрать();
	Пока ВыборкаПодчиненных.Следующий() Цикл
		ДокОбъект = ВыборкаПодчиненных.Ссылка.ПолучитьОбъект();
		Попытка
			Текст = Строка(ДокОбъект);
			ДокОбъект.Удалить();
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Текст + " удалён";
			//Сообщение.Поле = "Номенклатура[10].Количество";
			//Сообщение.УстановитьДанные(СсылкаНаДокумент.ПолучитьОбъект());
			Сообщение.Сообщить();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Закроем форму и удалим документ-основание
	ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	Попытка
		ДокОбъект.УстановитьПометкуУдаления(Истина);
	Исключение
	КонецПопытки;
	
	//ТекстДок = Новый ТекстовыйДокумент;
	//ТекстДок.Прочитать("C:\Users\a.stepanov\Desktop\txt.txt");
	//ТекстДок.ДобавитьСтроку("получитьокна().количество(): " + получитьокна().количество());
	//ТекстДок.Записать("C:\Users\a.stepanov\Desktop\txt.txt");
	
	//Сообщение = Новый СообщениеПользователю();
	//Сообщение.Текст = "пыщь";
	////Сообщение.Поле = "Номенклатура[10].Количество";
	////Сообщение.УстановитьДанные(СсылкаНаДокумент.ПолучитьОбъект());
	//Сообщение.Сообщить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Возврат ТабличныйДокумент;

КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(СсылкаНаДокумент) Экспорт
	
	Форма = СсылкаНаДокумент.ПолучитьФорму("ФормаДокумента");
	Форма.Закрыть();
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуВРТУ", "Счет на оплату (шаблон)", СформироватьПечатнуюФорму(МассивОбъектов[0], ОбъектыПечати));

КонецПроцедуры // Печать()