// Внешняя функция печати
// КТ-2000: (095)789-3070
// Параметры
//  ИмяМакета  – Строка – имя формы печати
//
// Возвращаемое значение:
//   Булево   –Печать прошла успешно - Истина, иначе - Ложь
//
Функция Печать(ИмяМакета = "", ПараметрыПечати = Неопределено)	Экспорт

	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
//	Если Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(СсылкаНаОбъект.Проведен) Тогда
//		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
//		Возврат Ложь;
//	КонецЕсли;
	
	ТабДокумент = ПечатьДокумента(СсылкаНаОбъект);
	
	//Определим параметры печати
	Если ПараметрыПечати <> Неопределено Тогда
		КоличествоЭкземпляров = 1;
		Если НЕ(ПараметрыПечати.Свойство("КоличествоЭкземпляров",КоличествоЭкземпляров)) Тогда
			КоличествоЭкземпляров = 1;			
		КонецЕсли;
		НаПринтер = Ложь;
		Если НЕ(ПараметрыПечати.Свойство("НаПринтер",НаПринтер)) Тогда
			НаПринтер = Ложь;			
		КонецЕсли;
	КонецЕсли;
	Если КоличествоЭкземпляров = Неопределено Тогда
		КоличествоЭкземпляров = 1;
	КонецЕсли;
	Если НаПринтер = Неопределено Тогда
		НаПринтер = Ложь;
	КонецЕсли;
//---КТ-2000-(095)789-3070---Олег-27.06.05
	//НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, СформироватьЗаголовокДокумента(ВыбОбъект));
	Возврат ТабДокумент;
//---КТ-2000-(095)789-3070---Олег-27.06.05

КонецФункции // Печать()

Функция ПечатьДокумента(СсылкаНаДокумент)
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати="ПАРАМЕТРЫ_ПЕЧАТИ_Приемный_акт_заказ_поставщику";
	
	Макет=ПолучитьМакет("Макет");
	
	ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер			= СсылкаНаДокумент.Номер;
	ОбластьШапка.Параметры.ДатаДокумента	= "____.____.________ г. ";
	ОбластьШапка.Параметры.Поставщик		= СсылкаНаДокумент.Контрагент.НаименованиеПолное;
	Отбор=Новый Структура("Объект,Свойство",СсылкаНаДокумент, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000009"));
	Рез=РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Отбор).Значение;
	Если ЗначениеЗаполнено(Рез) Тогда
		ОбластьШапка.Параметры.Водитель=Строка(Рез);
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Количество
		|		ИНАЧЕ ЗаказПоставщикуТовары.КоличествоМест
		|	КОНЕЦ КАК КолМест,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.ЕдиницаИзмерения
		|		ИНАЧЕ ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест
		|	КОНЕЦ КАК ЕдИзм,
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО ЗаказПоставщикуТовары.Номенклатура = Штрихкоды.Владелец
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &СсылкаНаДокумент";
		//|	И ЗаказПоставщикуТовары.Номенклатура В ИЕРАРХИИ(&ПивоРозлив)";
	Запрос.УстановитьПараметр("СсылкаНаДокумент",	СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПивоРозлив",			Справочники.ИТИКонстанты.РазливноеПиво.Указатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();           
	СчПП=1;
	ОбластьСтрокаДанных=Макет.ПолучитьОбласть("СтрокаДанных");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрокаДанных.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьСтрокаДанных.Параметры.Нпп=СчПП;
		ТабДокумент.Вывести(ОбластьСтрокаДанных);
		СчПП=СчПП+1;
	КонецЦикла;
	//Отбивка
	ОбластьСтрокаДанных=Макет.ПолучитьОбласть("СтрокаДанных");
	Для Сч=0 По 6 Цикл
		ОбластьСтрокаДанных.Параметры.Нпп=СчПП;
		ТабДокумент.Вывести(ОбластьСтрокаДанных);
		СчПП=СчПП+1;
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест.Объем КАК Объем,
		|	СУММА(ЗаказПоставщикуТовары.КоличествоМест) КАК КолМест
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ПО ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &СсылкаНаДокумент
		|	И ЗаказПоставщикуТовары.Номенклатура В ИЕРАРХИИ(&ПивоРозлив)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПоставщикуТовары.ЕдиницаИзмеренияМест.Объем
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объем";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОбластьИтого=Макет.ПолучитьОбласть("СтрокаИтого");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьИтого.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьИтого.Параметры.Нпп=СчПП;
		ТабДокумент.Вывести(ОбластьИтого);
		СчПП=СчПП+1;
	КонецЦикла;
	ОбластьОтбивка=Макет.ПолучитьОбласть("ОтбивкаВПустую");
	ОбластьОтбивка.Параметры.Нпп=СчПП;
	ТабДокумент.Вывести(ОбластьОтбивка);
	СчПП=СчПП+1;
	ОбластьОтбивка=Макет.ПолучитьОбласть("ОтбивкаПоддоны");
	ОбластьОтбивка.Параметры.Нпп=СчПП;
	ТабДокумент.Вывести(ОбластьОтбивка);
	ОбластьПодписи=Макет.ПолучитьОбласть("Подписи");
	ТабДокумент.Вывести(ОбластьПодписи);
	
	Возврат ТабДокумент;	
КонецФункции