
&НаКлиенте
Процедура ПечатьДокумента(Команда)
	
	ТабДок = Новый  ТабличныйДокумент;
	ПечатьДокументаНаСервере(ТабДок);
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьДокументаНаСервере(ТабДок)
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объект.СсылкаНаОбъект);
	
	ОбъектыПечати 		  = Новый СписокЗначений;
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ЭтотОбъект.Идентификатор);
	ПараметрыВывода 	  = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();

	ЭтотОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	ТабДок = КоллекцияПечатныхФорм[0].ТабличныйДокумент;
	
КОнецПРоцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивНазначений = РеквизитФормыВЗначение("Объект").МассивНазначений;
	МассивТипов      = Новый Массив();
	
	Для каждого СтрокаМассива Из МассивНазначений Цикл
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(СтрокаМассива);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивТипов.Добавить(ТипЗнч(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных).ЗначениеПустойСсылки));
	КонецЦикла; 
	
	Элементы.СсылкаНаДокумент.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры

