
Процедура КнопкаВыполнитьНажатие(Кнопка)

	СтруктураВнешнихПараметров= Новый Структура;
	СтруктураВнешнихПараметров.Вставить("ПечататьНаПринтер", Истина);
	СтруктураВнешнихПараметров.Вставить("Принтер", "");
	СтруктураВнешнихПараметров.Вставить("КоличествоЭкземпляров", 1);

	Печать(,,СтруктураВнешнихПараметров);
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
    ТабДокумент=Новый ТабличныйДокумент;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	НоменклатураСертификаты.ПутьДоФайла КАК ПутьДао
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Сертификаты КАК НоменклатураСертификаты
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураСертификаты.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И (НоменклатураСертификаты.ОрганизацияВладелец ЕСТЬ NULL 
		|			ИЛИ НоменклатураСертификаты.ОрганизацияВладелец = РеализацияТоваровУслуг.Организация)
		|	И НоменклатураСертификаты.Действителен";
	oApp = Новый COMОбъект("AcroExch.App");
    AcrDoc = Новый COMОбъект("AcroExch.AVDoc");
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Прав(ВыборкаДетальныеЗаписи.ПутьДао,3)="pdf" Тогда
			//КомандаСистемы("C:\print.bat """+ВыборкаДетальныеЗаписи.ПутьДао+"""");
			AcrDoc.Open(ВыборкаДетальныеЗаписи.ПутьДао, "PDF Print");
			AcroPDDoc = AcrDoc.GetPDDoc();
			lngPages = AcroPDDoc.GetNumPages() - 1;
			AcrDoc.PrintPages( 1, lngPages);
		КонецЕсли;
	КонецЦикла;
    AcrDoc.Close(Истина);
КонецПроцедуры
